_posts/2022-02-04-boj-2004.html
---
title: BOJ 2004 조합
tags: 수학
---

<div id="outline-container-org65a16e4" class="outline-2">
<h2 id="org65a16e4">BOJ 2004 조합</h2>
</div>
<div id="outline-container-org0d8b4b3" class="outline-2">
<h2 id="org0d8b4b3">접근하기</h2>
<div class="outline-text-2" id="text-org0d8b4b3">
<pre class="example">
2, 5의 승수를 센다
</pre>
</div>
</div>

<div id="outline-container-orgccd69df" class="outline-2">
<h2 id="orgccd69df">코드 1</h2>
<div class="outline-text-2" id="text-orgccd69df">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">power2</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ret</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(num &gt;=2) {
        ret += num / 2;
        num = num / 2;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> ret;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">power5</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ret</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">while</span>(num &gt;=5) {
        ret += num / 5;
        num = num / 5;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> ret;
}


<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
    <span style="color: #ff6347;">cin</span> &gt;&gt; N &gt;&gt; M;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = power2(N) - power2(N-M) - power2(M);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n2</span> = power5(N) - power5(N-M) - power5(M);
    cout &lt;&lt; min(n1, n2) &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org92e70cf" class="outline-2">
<h2 id="org92e70cf">코드 2</h2>
<div class="outline-text-2" id="text-org92e70cf">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">cnt2</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">i</span>=2;i&lt;=num;i*=2) {
        sum += num / i;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> sum;
}

<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #edd400; font-weight: bold;">cnt5</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">sum</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">i</span>=5;i&lt;=num;i*=5) {
        sum += num / i;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> sum;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
    <span style="color: #ff6347;">cin</span> &gt;&gt; N &gt;&gt; M;
    <span style="color: #888a85;">// </span><span style="color: #888a85;">N!</span>
    <span style="color: #888a85;">// </span><span style="color: #888a85;">(N-M)!</span>
    <span style="color: #888a85;">// </span><span style="color: #888a85;">M!</span>
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">n1</span> = cnt2(N) - cnt2(N-M) - cnt2(M);
    <span style="color: #8ae234; font-weight: bold;">ll</span> <span style="color: #ff6347;">n2</span> = cnt5(N) - cnt5(N-M) - cnt5(M);

    cout &lt;&lt; min(n1, n2) &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>; 
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org50617b6" class="outline-2">
<h2 id="org50617b6">해설 참고</h2>
<div class="outline-text-2" id="text-org50617b6">
<ul class="org-ul">
<li><a href="https://st-lab.tistory.com/166">https://st-lab.tistory.com/166</a></li>
<li><a href="https://sihyungyou.github.io/baekjoon-2004/">https://sihyungyou.github.io/baekjoon-2004/</a></li>
</ul>
</div>
</div>
<div id="outline-container-org415a1c5" class="outline-2">
<h2 id="org415a1c5">문제 링크</h2>
<div class="outline-text-2" id="text-org415a1c5">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/2004">https://www.acmicpc.net/problem/2004</a></li>
</ul>
</div>
</div>
